# CircularDependencyConstraintError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..CircularDependencyConstraintError Property
BuiltInFailures..::..RegenFailures Class See Also
---
Highlighted constraints cause a circular chain of references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularDependencyConstraintError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularDependencyConstraintError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularDependencyConstraintError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace